#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform
tls_private_key.pk: Refreshing state... [id=1d648cda333e711780a9a9d0b71e0a1f90a686f5]
data.aws_availability_zones.myApp: Reading...
data.aws_ami.ubuntu: Reading...
aws_key_pair.pk: Refreshing state... [id=myKey]
aws_default_vpc.myApp: Refreshing state... [id=vpc-01e31438478a7b4a0]
local_file.pk: Refreshing state... [id=bd50d899d7e8cd08c1bfee90855645ca562bcb6a]
data.aws_availability_zones.myApp: Read complete after 1s [id=eu-west-2]
aws_default_subnet.default_az1: Refreshing state... [id=subnet-0e2c4c58a10c41418]
aws_default_subnet.default_az2: Refreshing state... [id=subnet-0163d1462d6e2dc84]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0f321d890424a6390]
aws_security_group.myApp: Refreshing state... [id=sg-04774bff44bf76d6b]
aws_instance.myAppTwo: Refreshing state... [id=i-0bc2ba5c3aa290673]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.pk will be created
  + resource "local_file" "pk" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "myKey.pem"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @daveacho, Action: `pull_request`, Workflow: `Terraform AWS`*